#lang racket/base


(provide (rename-out
          [define 名]
          [let 令]

          [if 若] ;; 如 若 倘 况
          [case 倘]
          [cond 况]

          [display 陈] ;; 陈 显 现 呈 示
          [displayln 陈行]

          [equal? 同乎]

          [list 链]

          ))



;; (名 马 "马")
;; (名 白马 "白马")

;; (若 (同乎 马 白马)
;;     (陈 "白马是马")
;;     (陈 "白马非马"))

;; (若 (= (+ 1 1) 2)
;;     (陈 "一一得二")
;;     (陈 "一一非二"))

;; (倘 (+ 1 1)
;;     [(1 2 3) (陈 "结果在1-3中")]
;;     [(4 5 6) (陈 "结果在1-3中")]
;;     [else (陈 "不再其列")])

;; (况
;;  [(positive? -5) (陈 "负五")]
;;  [(zero? -5) (陈 "为零")]
;;  [(positive? 5) (陈 "正五")])
